
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第六章 监视和防御系统 · 机器人小车项目</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="陈昊 编辑 编译">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-yahei/yahei.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-donate/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-alerts/style.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="../styles/website.css">
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../Chapter6/" />
    
    
    <link rel="prev" href="../Chapter4/" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://www.creativewriting.cn/" target="_blank" class="custom-link">返回主页</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    《机器人小车项目》
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第一部分 机器人小车的安装</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="../Preface/">
            
                <a href="../Preface/">
            
                    
                    第一章 概述
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="../Chapter1/">
            
                <a href="../Chapter1/">
            
                    
                    第二章 传动系统
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="../Chapter2/">
            
                <a href="../Chapter2/">
            
                    
                    第三章 电机驱动器及python程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.4" data-path="../Chapter3/">
            
                <a href="../Chapter3/">
            
                    
                    第四章 户外摄像头套件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.5" data-path="../Chapter4/">
            
                <a href="../Chapter4/">
            
                    
                    第五章 差分GPS
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="2.6" data-path="./">
            
                <a href="./">
            
                    
                    第六章 监视和防御系统
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第二部分 GPS解决方案</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="../Chapter6/">
            
                <a href="../Chapter6/">
            
                    
                    第七章 概述
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="../Chapter7/">
            
                <a href="../Chapter7/">
            
                    
                    第八章 理论设置
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="../Chapter8/">
            
                <a href="../Chapter8/">
            
                    
                    第九章 GPS天线设置
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="../Chapter9/">
            
                <a href="../Chapter9/">
            
                    
                    第十章 软件安装
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="../Chapter10/">
            
                <a href="../Chapter10/">
            
                    
                    第十一章 基站配置
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.6" data-path="../Chapter11/">
            
                <a href="../Chapter11/">
            
                    
                    第十二章 移动单元配置
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">第二部分 资源与参考</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="../Reference/">
            
                <a href="../Reference/">
            
                    
                    参考 PCA9685的使用说明
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="../Reference/README1.html">
            
                <a href="../Reference/README1.html">
            
                    
                    参考 BTS7960的使用说明
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="../Resouces/README.md">
            
                <span>
            
                    
                    资源
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第六章 监视和防御系统</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
                                <section class="normal markdown-section">
                                
<div id="vip-container">
    <p>&#x76D1;&#x89C6;&#xFF0C;&#x9632;&#x5FA1;&#x548C;&#x5B89;&#x5168;&#x673A;&#x5668;&#x4EBA;&#x7684;&#x60F3;&#x6CD5;&#x59CB;&#x4E8E;Big Rob&#x7684;Raspberry Pi&#x673A;&#x5668;&#x4EBA;&#x7684;&#x5F00;&#x53D1;&#x3002;&#x65B0;&#x578B;&#x673A;&#x5668;&#x4EBA;&#x7684;&#x6784;&#x60F3;&#x662F;&#x5BF9;&#x5E26;&#x6709;&#x5B89;&#x5168;&#x6027;&#x9644;&#x52A0;&#x7EC4;&#x4EF6;&#x7684;Big Rob&#x57FA;&#x7840;&#x7684;&#x8FDB;&#x4E00;&#x6B65;&#x53D1;&#x5C55;&#x3002;&#x673A;&#x5668;&#x4EBA;&#x9075;&#x5FAA;&#x6A21;&#x5757;&#x5316;&#x8BBE;&#x8BA1;&#x601D;&#x60F3;&#x3002;&#x8FD9;&#x4F7F;&#x8BE5;&#x673A;&#x5668;&#x4EBA;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#xFF0C;&#x5FEB;&#x901F;&#x5730;&#x5B8C;&#x6210;&#x4E0D;&#x540C;&#x4EFB;&#x52A1;&#x7684;&#x4FEE;&#x6539;&#x3002;&#x8FD9;&#x4F7F;&#x5BA2;&#x6237;&#x53EF;&#x4EE5;&#x5C06;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#x4EBA;&#x7528;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x4EFB;&#x52A1;&#x3002;&#x8FD9;&#x79CD;&#x6A21;&#x5757;&#x5316;&#x8BBE;&#x8BA1;&#x975E;&#x5E38;&#x7ECF;&#x6D4E;&#x9AD8;&#x6548;&#x3002;</p>
<p>&#x4E0B;&#x56FE;&#x663E;&#x793A;&#x4E86;&#x5B89;&#x5168;&#x673A;&#x5668;&#x4EBA;&#xFF0C;&#x5B83;&#x662F;&#x7528;&#x4E8E;&#x786C;&#x4EF6;&#x548C;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x7684;&#x539F;&#x578B;&#x3002;</p>
<p><div class="image-wrapper"><img src="http://yuntu88.oss-cn-beijing.aliyuncs.com/fromlocal/1242937438@qq.com/20191220/nApDwNtM7D.jpg" alt="&#x81EA;&#x5B9A;&#x4E49;&#x6784;&#x5EFA;&#x673A;&#x5668;&#x4EBA;-&#x5B89;&#x5168;&#x673A;&#x5668;&#x4EBA;"></div>
<!-- more --></p>
<h4 id="&#x5B89;&#x5168;&#x673A;&#x5668;&#x4EBA;&#x529F;&#x80FD;&#x5217;&#x8868;&#xFF1A;">&#x5B89;&#x5168;&#x673A;&#x5668;&#x4EBA;&#x529F;&#x80FD;&#x5217;&#x8868;&#xFF1A;</h4>
<p>&#x8BE5;&#x5217;&#x8868;&#x662F;&#x5B89;&#x5168;&#x673A;&#x5668;&#x4EBA;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7684;&#x529F;&#x80FD;&#x8BA1;&#x5212;&#x7684;&#x6982;&#x8FF0;&#x3002;&#x5E76;&#x672A;&#x5217;&#x51FA;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4F46;&#x5E94;&#x8BE5;&#x663E;&#x793A;&#x5F53;&#x524D;&#x53EF;&#x80FD;&#x7684;&#x529F;&#x80FD;&#x548C;&#x8BBE;&#x7F6E;&#x3002;</p>
<ul>
<li>&#x79FB;&#x52A8;&#x89C6;&#x9891;&#x76D1;&#x63A7;&#xFF0C;&#x5177;&#x6709;&#x7528;&#x4E8E;&#x767D;&#x5929;&#x64CD;&#x4F5C;&#x7684;&#x5E7F;&#x89D2;&#x6444;&#x50CF;&#x5934;&#x548C;&#x7528;&#x4E8E;&#x591C;&#x95F4;&#x76D1;&#x63A7;&#x7684;&#x7EA2;&#x5916;&#x6444;&#x50CF;&#x5934;&#x3002;</li>
<li>&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;</li>
<li>&#x8FDC;&#x7A0B;&#x89C6;&#x9891;&#x76D1;&#x63A7;Web&#x754C;&#x9762;&#x3002;&#x8BE5;&#x754C;&#x9762;&#x53EF;&#x5728;&#x5E73;&#x677F;&#x7535;&#x8111;&#xFF0C;PC&#x6216;&#x667A;&#x80FD;&#x624B;&#x673A;&#x4E0A;&#x8F7B;&#x677E;&#x8FD0;&#x884C;&#xFF0C;&#x5E76;&#x9075;&#x5FAA;HTML&#x548C;&#x54CD;&#x5E94;&#x5F0F;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3002;</li>
<li>&#x901A;&#x8FC7;&#x5185;&#x7F6E;&#x5F55;&#x50CF;&#x673A;&#x8FDE;&#x7EED;&#x5F55;&#x50CF;&#x3002;</li>
<li>&#x5728;&#x89C2;&#x5BDF;&#x4F4D;&#x7F6E;&#x4E4B;&#x95F4;&#x79FB;&#x52A8;&#xFF0C;&#x4F8B;&#x5982;&#x5728;&#x6CA1;&#x6709;&#x64CD;&#x4F5C;&#x5458;&#x6307;&#x5BFC;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x901A;&#x8FC7;&#x5DEE;&#x5206;GPS&#x5728;&#x4E00;&#x6761;&#x8DEF;&#x5F84;&#x4E0A;&#x79FB;&#x52A8;&#x3002;</li>
<li>&#x81EA;&#x52A8;&#x7ED5;&#x8FC7;&#x969C;&#x788D;&#x7269;&#x884C;&#x9A76;&#x5E76;&#x8FD4;&#x56DE;&#x4EE5;&#x7ED9;&#x7535;&#x6C60;&#x5145;&#x7535;&#x3002;</li>
<li>&#x81EA;&#x4E3B;&#x5DE1;&#x903B;&#x65F6;&#x95F4;6&#x5C0F;&#x65F6;&#xFF1B;&#x5DE5;&#x4F5C;&#x8303;&#x56F4;&#x957F;&#x8FBE;8&#x516C;&#x91CC;&#x3002;</li>
<li>&#x7EF4;&#x62A4;&#x6210;&#x672C;&#x4E0E;&#x673A;&#x5668;&#x4EBA;&#x8349;&#x576A;&#x5272;&#x8349;&#x7CFB;&#x7EDF;&#x4E00;&#x6837;&#x4F4E;&#x3002;</li>
<li>&#x5168;&#x5929;&#x5019;&#x548C;&#x663C;&#x591C;&#x8FD0;&#x884C;&#x3002;</li>
<li>&#x4F4E;&#x566A;&#x58F0;&#x7535;&#x52A8;&#x673A;&#x9A71;&#x52A8;&#x5668;&#xFF0C;&#x7528;&#x4E8E;&#x9690;&#x8EAB;&#x6A21;&#x5F0F;&#x64CD;&#x4F5C;&#x3002;</li>
</ul>
<h4 id="&#x89C6;&#x9891;&#x76D1;&#x63A7;&#xFF1A;">&#x89C6;&#x9891;&#x76D1;&#x63A7;&#xFF1A;</h4>
<p>&#x4F7F;&#x7528;&#x5B89;&#x5168;&#x673A;&#x5668;&#x4EBA;&#xFF0C;&#x53EF;&#x4EE5;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x5730;&#x8BBE;&#x7F6E;&#x79FB;&#x52A8;&#x4E14;&#x975E;&#x5E38;&#x7075;&#x6D3B;&#x7684;&#x89C6;&#x9891;&#x76D1;&#x89C6;&#x7CFB;&#x7EDF;&#x3002;&#x5728;&#x9014;&#x4E2D;&#x6216;&#x5230;&#x8FBE;&#x89C2;&#x5BDF;&#x4F4D;&#x7F6E;&#x540E;&#xFF0C;&#x673A;&#x5668;&#x4EBA;&#x90FD;&#x80FD;&#x7ACB;&#x5373;&#x63A7;&#x5236;&#x8BE5;&#x533A;&#x57DF;&#x3002;</p>
<p>&#x5728;&#x65E5;&#x5E38;&#x64CD;&#x4F5C;&#x4E2D;&#xFF0C;&#x673A;&#x5668;&#x4EBA;&#x914D;&#x5907;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x5E7F;&#x89D2;&#x6444;&#x50CF;&#x5934;&#x7CFB;&#x7EDF;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x673A;&#x5668;&#x4EBA;&#x5468;&#x56F4;360&#x5EA6;&#x5168;&#x65B9;&#x4F4D;&#x89C2;&#x770B;&#x3002;&#x8FD9;&#x4E9B;&#x76F8;&#x673A;&#x9488;&#x5BF9;&#x65E5;&#x5149;&#x8FDB;&#x884C;&#x4E86;&#x4F18;&#x5316;&#x3002;&#x4E3A;&#x7075;&#x6D3B;&#x8D77;&#x89C1;&#xFF0C;&#x8BE5;&#x673A;&#x5668;&#x4EBA;&#x8FD8;&#x989D;&#x5916;&#x914D;&#x5907;&#x4E86;&#x7EA2;&#x5916;&#x6444;&#x50CF;&#x5934;&#x7CFB;&#x7EDF;&#x548C;&#x7EA2;&#x5916;&#x6CDB;&#x5149;&#x706F;&#x7CFB;&#x7EDF;&#x3002;&#x8FD9;&#x4F7F;&#x673A;&#x5668;&#x4EBA;&#x53EF;&#x4EE5;&#x5728;&#x591C;&#x95F4;&#x76D1;&#x89C6;&#x6307;&#x5B9A;&#x533A;&#x57DF;&#x3002;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x64CD;&#x4F5C;&#x5458;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x767D;&#x5929;&#x548C;&#x665A;&#x4E0A;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x65F6;&#x5927;&#x81F4;&#x4E86;&#x89E3;&#x673A;&#x5668;&#x4EBA;&#x76D1;&#x89C6;&#x533A;&#x57DF;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x6D3B;&#x52A8;&#x3002;</p>
<p><div class="image-wrapper"><img src="http://yuntu88.oss-cn-beijing.aliyuncs.com/fromlocal/1242937438@qq.com/20191220/dWYxSNTHXi.jpg" alt="&#x81EA;&#x5B9A;&#x4E49;&#x6784;&#x5EFA;&#x673A;&#x5668;&#x4EBA;-&#x5B89;&#x5168;&#x673A;&#x5668;&#x4EBA;&#x89C6;&#x9891;&#x76D1;&#x63A7;"></div></p>
<h4 id="&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#xFF1A;">&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#xFF1A;</h4>
<p>&#x65E0;&#x9700;&#x7279;&#x6B8A;&#x7684;&#x7F51;&#x7EDC;&#x8BBE;&#x7F6E;&#x3002;&#x8BE5;&#x673A;&#x5668;&#x4EBA;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x96C6;&#x6210;&#x5230;&#x672C;&#x5730;WIFI&#x7CFB;&#x7EDF;&#x4E2D;&#x3002;&#x901A;&#x8FC7;&#x9644;&#x52A0;&#x6A21;&#x5757;&#xFF0C;&#x5B89;&#x5168;&#x673A;&#x5668;&#x4EBA;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5168;&#x56FD;&#x8303;&#x56F4;&#x7684;&#x65E0;&#x7EBF;&#x7F51;&#x7EDC;&#x3002;&#x914D;&#x5907;&#x4E86;&#x8FD9;&#x4E9B;&#x7F51;&#x7EDC;&#x6A21;&#x5757;&#xFF08;&#x5982;5G&#x65E0;&#x7EBF;&#x901A;&#x4FE1;&#x6A21;&#x5757;&#xFF09;&#xFF0C;&#x8BE5;&#x673A;&#x5668;&#x4EBA;&#x7684;&#x8FDE;&#x63A5;&#x6027;&#x975E;&#x5E38;&#x9002;&#x5408;&#x5E02;&#x533A;&#x3002;&#x4E3A;&#x4E86;&#x5728;&#x73B0;&#x573A;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x673A;&#x5668;&#x4EBA;&#x53EF;&#x4EE5;&#x989D;&#x5916;&#x914D;&#x5907;&#x4E0D;&#x540C;&#x7684;XBee&#x6A21;&#x5757;&#x3002;</p>
<p>&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x673A;&#x5668;&#x4EBA;&#x4F1A;&#x914D;&#x5907;&#x4E0D;&#x540C;&#x7684;WIFI&#x6A21;&#x5757;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x5B89;&#x5168;&#x5FEB;&#x901F;&#x7684;&#x65E0;&#x7EBF;&#x8FDE;&#x63A5;&#x3002;</p>
<h4 id="&#x8FDC;&#x7A0B;&#x673A;&#x5668;&#x4EBA;&#x63A7;&#x5236;&#xFF1A;">&#x8FDC;&#x7A0B;&#x673A;&#x5668;&#x4EBA;&#x63A7;&#x5236;&#xFF1A;</h4>
<p>&#x901A;&#x8FC7;&#x5185;&#x7F6E;&#x7684;Web&#x754C;&#x9762;&#xFF0C;&#x63A7;&#x5236;&#x673A;&#x5668;&#x4EBA;&#x975E;&#x5E38;&#x65B9;&#x4FBF;&#x3002;&#x901A;&#x8FC7;Web&#x754C;&#x9762;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6240;&#x6709;&#x53EF;&#x7528;&#x7684;&#x76D1;&#x89C6;&#x6A21;&#x5F0F;&#x3002;&#x64CD;&#x4F5C;&#x5458;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x9009;&#x62E9;&#x4E00;&#x79CD;&#x6A21;&#x5F0F;&#x5E76;&#x5F00;&#x59CB;&#x89C2;&#x5BDF;&#x3002;&#x89E6;&#x6478;&#x754C;&#x9762;&#x4F7F;&#x63A7;&#x5236;&#x673A;&#x5668;&#x4EBA;&#x7684;&#x529F;&#x80FD;&#x4EE5;&#x53CA;&#x8FDC;&#x7A0B;&#x63A7;&#x5236;&#x5B89;&#x5168;&#x673A;&#x5668;&#x4EBA;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x3002;&#x5E73;&#x677F;&#x7535;&#x8111;&#x6216;&#x667A;&#x80FD;&#x624B;&#x673A;&#x8DB3;&#x4EE5;&#x624B;&#x52A8;&#x63A7;&#x5236;&#x673A;&#x5668;&#x4EBA;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6709;&#x4EBA;&#x8FDB;&#x5165;&#x76D1;&#x89C6;&#x533A;&#x57DF;&#xFF0C;&#x673A;&#x5668;&#x4EBA;&#x5C06;&#x5B9E;&#x65F6;&#x89C6;&#x9891;&#x76F4;&#x63A5;&#x6D41;&#x5411;&#x64CD;&#x4F5C;&#x5458;&#xFF0C;&#x6216;&#x901A;&#x8FC7;&#x8B66;&#x62A5;&#x6D88;&#x606F;&#x901A;&#x77E5;&#x64CD;&#x4F5C;&#x5458;&#x3002;</p>
<p>&#x8BE5;&#x754C;&#x9762;&#x4F7F;&#x7528;HTML5&#x6765;&#x786E;&#x4FDD;&#x4E0E;&#x6700;&#x65B0;&#x7684;Web&#x6D4F;&#x89C8;&#x5668;&#x548C;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x517C;&#x5BB9;&#x3002;</p>
<h4 id="&#x8FDE;&#x7EED;&#x5F55;&#x50CF;&#xFF1A;">&#x8FDE;&#x7EED;&#x5F55;&#x50CF;&#xFF1A;</h4>
<p>&#x673A;&#x5668;&#x4EBA;&#x914D;&#x5907;&#x4E86;&#x4F4E;&#x529F;&#x8017;&#x667A;&#x80FD;&#x9A71;&#x52A8;&#x5668;&#xFF0C;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4FDD;&#x5B58;&#x5F55;&#x5236;&#x7684;&#x89C6;&#x9891;&#x6587;&#x4EF6;&#x3002;&#x64CD;&#x4F5C;&#x5458;&#x53EF;&#x4EE5;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x5E94;&#x5B58;&#x50A8;&#x591A;&#x957F;&#x65F6;&#x95F4;&#x3002;&#x53EF;&#x4EE5;&#x5728;&#x5B9A;&#x4E49;&#x7684;&#x65F6;&#x95F4;&#x6BB5;&#x540E;&#x81EA;&#x52A8;&#x6216;&#x7531;&#x64CD;&#x4F5C;&#x5458;&#x624B;&#x52A8;&#x5220;&#x9664;&#x6587;&#x4EF6;&#x3002;&#x6240;&#x6709;&#x6587;&#x4EF6;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;WIFI&#x7F51;&#x7EDC;&#x6216;LAN&#x8FDE;&#x63A5;&#x8F7B;&#x677E;&#x4E0B;&#x8F7D;&#x5230;PC&#x6216;&#x5176;&#x4ED6;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x3002;</p>
<h4 id="&#x5728;&#x89C2;&#x5BDF;&#x4F4D;&#x7F6E;&#x4E4B;&#x95F4;&#x79FB;&#x52A8;&#xFF1A;">&#x5728;&#x89C2;&#x5BDF;&#x4F4D;&#x7F6E;&#x4E4B;&#x95F4;&#x79FB;&#x52A8;&#xFF1A;</h4>
<p>&#x5B9A;&#x4E49;&#x89C2;&#x5BDF;&#x4F4D;&#x7F6E;&#x5E76;&#x5C06;&#x5176;&#x4E0A;&#x4F20;&#x5230;&#x673A;&#x5668;&#x4EBA;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x3002;&#x673A;&#x5668;&#x4EBA;&#x5185;&#x90E8;&#x7684;&#x8F6F;&#x4EF6;&#x80FD;&#x591F;&#x8BFB;&#x53D6;&#x4E0D;&#x540C;&#x7684;GPS&#x5750;&#x6807;&#xFF0C;&#x4F8B;&#x5982;KMZ&#x6216;KML&#x6587;&#x4EF6;&#x3002;&#x5C06;&#x6587;&#x4EF6;&#x4E0A;&#x4F20;&#x5230;&#x7CFB;&#x7EDF;&#x540E;&#xFF0C;&#x673A;&#x5668;&#x4EBA;&#x53EF;&#x4EE5;&#x52A0;&#x8F7D;&#x822A;&#x8DEF;&#x70B9;&#x5E76;&#x5F00;&#x59CB;&#x89C2;&#x5BDF;&#x3002;&#x673A;&#x5668;&#x4EBA;&#x9075;&#x5FAA;&#x7ED9;&#x5B9A;&#x7684;&#x8DEF;&#x5F84;&#x5230;&#x8FBE;&#x89C2;&#x5BDF;&#x4F4D;&#x7F6E;&#xFF0C;&#x5F00;&#x59CB;&#x89C2;&#x5BDF;&#xFF0C;&#x7136;&#x540E;&#x53EF;&#x4EE5;&#x884C;&#x9A76;&#x5230;&#x4E0B;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#x3002;</p>
<p><div class="image-wrapper"><img src="http://yuntu88.oss-cn-beijing.aliyuncs.com/fromlocal/1242937438@qq.com/20191220/M3zfKD6mk5.jpg" alt="RasPiGNSS&#x7406;&#x8BBA;&#x8BBE;&#x7F6E;"></div></p>
<h4 id="&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#xFF1A;">&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#xFF1A;</h4>
<p>&#x4ECE;&#x4E00;&#x4E2A;&#x89C2;&#x5BDF;&#x70B9;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x89C2;&#x5BDF;&#x70B9;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x673A;&#x5668;&#x4EBA;&#x4F1A;&#x81EA;&#x52A8;&#x7ED5;&#x8FC7;&#x969C;&#x788D;&#x7269;&#x884C;&#x9A76;&#x3002;&#x5728;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x673A;&#x5668;&#x4EBA;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x53E6;&#x4E00;&#x7EC4;&#x4F20;&#x611F;&#x5668;&#x626B;&#x63CF;&#x5468;&#x56F4;&#x73AF;&#x5883;&#xFF0C;&#x4ECE;&#x800C;&#x5B89;&#x5168;&#x884C;&#x9A76;&#x3002;&#x64CD;&#x4F5C;&#x5458;&#x53EA;&#x9700;&#x8BA1;&#x5212;&#x8DEF;&#x5F84;&#x548C;&#x89C2;&#x5BDF;&#x70B9;&#xFF0C;&#x673A;&#x5668;&#x4EBA;&#x5C06;&#x81EA;&#x52A8;&#x9A71;&#x52A8;&#x76F4;&#x5230;&#x5230;&#x8FBE;&#x8BA1;&#x5212;&#x4F4D;&#x7F6E;&#x3002;</p>
<h4 id="&#x64CD;&#x4F5C;&#x65F6;&#x95F4;&#xFF1A;">&#x64CD;&#x4F5C;&#x65F6;&#x95F4;&#xFF1A;</h4>
<p>&#x673A;&#x5668;&#x4EBA;&#x53EF;&#x4EE5;&#x81EA;&#x4E3B;&#x8FD0;&#x884C;&#x6216;&#x624B;&#x52A8;&#x63A7;&#x5236;&#x6570;&#x5C0F;&#x65F6;&#x3002;&#x6839;&#x636E;&#x5185;&#x7F6E;&#x7535;&#x6E90;&#xFF0C;&#x5730;&#x5F62;&#x548C;&#x884C;&#x9A76;&#x8DDD;&#x79BB;&#xFF0C;&#x673A;&#x5668;&#x4EBA;&#x5728;&#x89C2;&#x5BDF;&#x6A21;&#x5F0F;&#x4E0B;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;6&#x4E2A;&#x5C0F;&#x65F6;&#x6216;&#x6700;&#x591A;30&#x4E2A;&#x5C0F;&#x65F6;&#x3002;</p>
<p><div class="image-wrapper"><img src="http://yuntu88.oss-cn-beijing.aliyuncs.com/fromlocal/1242937438@qq.com/20191220/kXdT5bWCif.jpg" alt="Peak Power Pack&#x9502;&#x79BB;&#x5B50;&#x7535;&#x6C60;"></div></p>
<h4 id="&#x7ECF;&#x6D4E;&#x6709;&#x6548;&#x7684;&#x7EF4;&#x62A4;&#xFF1A;">&#x7ECF;&#x6D4E;&#x6709;&#x6548;&#x7684;&#x7EF4;&#x62A4;&#xFF1A;</h4>
<p>&#x73B0;&#x4EE3;&#x9502;&#x79BB;&#x5B50;LiFeO4&#x7535;&#x6C60;&#x975E;&#x5E38;&#x8282;&#x7701;&#xFF0C;&#x5E76;&#x4E14;&#x5177;&#x6709;&#x5F88;&#x9AD8;&#x7684;&#x80FD;&#x91CF;&#x5BC6;&#x5EA6;&#x3002;&#x6700;&#x591A;&#x53EF;&#x8FDB;&#x884C;3000&#x6B21;&#x5145;&#x7535;&#xFF0C;&#x65E0;&#x9700;&#x66F4;&#x6362;&#x7535;&#x6C60;&#x5373;&#x53EF;&#x957F;&#x65F6;&#x95F4;&#x4F7F;&#x7528;&#x3002;&#x9502;&#x79BB;&#x5B50;&#x6280;&#x672F;&#x514D;&#x7EF4;&#x62A4;&#xFF0C;&#x5185;&#x7F6E;&#x7535;&#x6C60;&#x5145;&#x7535;&#x548C;&#x7535;&#x6C60;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x4F7F;&#x673A;&#x5668;&#x4EBA;&#x6613;&#x4E8E;&#x7EF4;&#x62A4;&#x3002;</p>
<h4 id="&#x6240;&#x6709;&#x5B63;&#x8282;&#xFF1A;">&#x6240;&#x6709;&#x5B63;&#x8282;&#xFF1A;</h4>
<p>&#x8BE5;&#x673A;&#x5668;&#x4EBA;&#x65E8;&#x5728;&#x4ECE;&#x51AC;&#x5B63;&#x5230;&#x590F;&#x5B63;&#x5168;&#x5929;&#x5019;&#x5DE5;&#x4F5C;&#x3002;&#x5728;&#x51AC;&#x5B63;&#xFF0C;&#x673A;&#x5668;&#x4EBA;&#x53EF;&#x4EE5;&#x6FC0;&#x6D3B;&#x5185;&#x7F6E;&#x52A0;&#x70ED;&#x5668;&#xFF0C;&#x4EE5;&#x9632;&#x6B62;&#x7535;&#x6C60;&#x7EC4;&#x51BB;&#x7ED3;&#x3002;&#x5728;&#x708E;&#x70ED;&#x7684;&#x590F;&#x5B63;&#xFF0C;&#x673A;&#x5668;&#x4EBA;&#x53EF;&#x4EE5;&#x542F;&#x52A8;&#x51B7;&#x5374;&#x7CFB;&#x7EDF;&#x6765;&#x51B7;&#x5374;&#x903B;&#x8F91;&#x5355;&#x5143;&#x548C;&#x7535;&#x5B50;&#x7EC4;&#x4EF6;&#x3002;</p>
<p><div class="image-wrapper"><img src="http://yuntu88.oss-cn-beijing.aliyuncs.com/fromlocal/1242937438@qq.com/20191220/J3G6GANWDt.jpg" alt="&#x5B9A;&#x5236;&#x673A;&#x5668;&#x4EBA;"></div></p>
<h4 id="&#x9690;&#x8EAB;&#x6A21;&#x5F0F;&#xFF1A;">&#x9690;&#x8EAB;&#x6A21;&#x5F0F;&#xFF1A;</h4>
<p>&#x673A;&#x5668;&#x4EBA;&#x4F7F;&#x7528;&#x7684;&#x76F4;&#x6D41;&#x7535;&#x52A8;&#x673A;&#x975E;&#x5E38;&#x575A;&#x56FA;&#x4E14;&#x975E;&#x5E38;&#x5B89;&#x9759;&#x3002;&#x8FD9;&#x4F7F;&#x673A;&#x5668;&#x4EBA;&#x53EF;&#x4EE5;&#x975E;&#x5E38;&#x5B89;&#x9759;&#x5730;&#x8FD0;&#x884C;&#x3002;&#x5728;&#x4ECE;&#x4E00;&#x4E2A;&#x89C2;&#x5BDF;&#x70B9;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x89C2;&#x5BDF;&#x70B9;&#x7684;&#x5173;&#x952E;&#x8F6C;&#x79FB;&#x4EFB;&#x52A1;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x5F88;&#x91CD;&#x8981;&#x3002;&#x5982;&#x679C;&#x673A;&#x5668;&#x4EBA;&#x5230;&#x8FBE;&#x8BE5;&#x4F4D;&#x7F6E;&#x5E76;&#x4E14;&#x76F4;&#x6D41;&#x7535;&#x52A8;&#x673A;&#x5DF2;&#x5173;&#x95ED;&#xFF0C;&#x5219;&#x5BF9;&#x4E8E;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x5373;&#x4F7F;&#x6709;&#x4E86;&#x6D3B;&#x52A8;&#x7EA2;&#x5916;&#x706F;&#xFF0C;&#x4EBA;&#x751A;&#x81F3;&#x90FD;&#x65E0;&#x6CD5;&#x53D1;&#x73B0;&#x673A;&#x5668;&#x4EBA;&#x3002;</p>
<p>&#x4E0B;&#x56FE;&#x663E;&#x793A;&#x4E86;&#x6211;&#x4EEC;&#x82B1;&#x56ED;&#x91CC;&#x7B49;&#x5F85;&#x591C;&#x665A;&#x7684;&#x673A;&#x5668;&#x4EBA;&#x3002;</p>
<p><div class="image-wrapper"><img src="http://yuntu88.oss-cn-beijing.aliyuncs.com/fromlocal/1242937438@qq.com/20191220/zY3krTikfr.jpg" alt="&#x5B9A;&#x5236;&#x673A;&#x5668;&#x4EBA;-&#x5B89;&#x5168;&#x673A;&#x5668;&#x4EBA;&#x6237;&#x5916;&#x6D4B;&#x8BD5;"></div></p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; creativewriting.cn 2020 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x6587;&#x4EF6;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2020-06-05 08:39:50
</span></footer>
</div>

                                </section>
                            
                        </div>
                    </div>
                
            </div>

            
                
                <a href="../Chapter4/" class="navigation navigation-prev " aria-label="Previous page: 第五章 差分GPS">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../Chapter6/" class="navigation navigation-next " aria-label="Next page: 第七章 概述">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第六章 监视和防御系统","date":"2019-12-20T17:38:07.000Z","tags":"机器人小车","categories":["内在提升","技能爱好","第二技能"],"level":"2.6","depth":1,"next":{"title":"第七章 概述","level":"3.1","depth":1,"path":"Chapter6/README.md","ref":"Chapter6/README.md","articles":[]},"previous":{"title":"第五章 差分GPS","level":"2.5","depth":1,"path":"Chapter4/README.md","ref":"Chapter4/README.md","articles":[]},"dir":"ltr"},"config":{"plugins":["splitter","openwrite","yahei","tbfed-pagefooter","donate","edit-link","back-to-top-button","expandable-chapters-small","-lunr","-search","alerts","image-wrapper"],"root":".","styles":{"website":"styles/website.css","ebook":"styles/ebook.css","pdf":"styles/pdf.css","mobi":"styles/mobi.css","epub":"styles/epub.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy creativewriting.cn 2020","modify_label":"文件修订时间：","modify_format":"YYYY-MM-DD HH:mm:ss"},"image-wrapper":{},"yahei":{},"splitter":{},"donate":{"alipay":"https://www.creativewriting.cn/gallery/thumbnails/alipay.jpg","alipayText":"支付宝打赏","button":"打赏","title":"","wechat":"https://www.creativewriting.cn/gallery/thumbnails/wechat.jpg","wechatText":"微信打赏"},"fontsettings":{"theme":"white","family":"sans","size":2},"fontSettings":{"family":"msyh","size":2},"highlight":{},"openwrite":{"blogId":"22130-1589358411406-636","name":"creativewriting","qrcode":"http://qiniu.creativewriting.cn/creativewriting.jpg","keyword":"vip"},"back-to-top-button":{},"alerts":{},"expandable-chapters-small":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"edit-link":{"label":"编辑本页","base":"https://github.com/chenhao2020/bookfortest/edit/gh-pages/"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"陈昊 编辑 编译","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"机器人小车项目","language":"zh-hans","links":{"sidebar":{"返回主页":"https://www.creativewriting.cn/"}},"gitbook":"*","description":"Todo：机器人小车项目"},"file":{"path":"Chapter5/README.md","mtime":"2020-06-05T08:39:50.716Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-06-05T08:40:38.862Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        

    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-donate/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-alerts/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

<script src="https://my.openwrite.cn/js/readmore.js" type="text/javascript"></script>
<script>
var isMobile = navigator.userAgent.match(/(phone|pad|pod|iPhone|iPod|ios|iPad|Android|Mobile|BlackBerry|IEMobile|MQQBrowser|JUC|Fennec|wOSBrowser|BrowserNG|WebOS|Symbian|Windows Phone)/i);
if (!isMobile) {
    var btw = new BTWPlugin();
    btw.init({
        "id": "vip-container",
        "blogId": "22130-1589358411406-636",
        "name": "creativewriting",
        "qrcode": "http://qiniu.creativewriting.cn/creativewriting.jpg",
        "keyword": "vip"
    });
}
</script>

    </body>
</html>

